app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("id_number", "name", "course", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id_number", "200910134"], ["name", "Jett Villamor"], ["course", "BS Information Technology"], ["created_at", 2017-02-01 20:40:46 UTC], ["updated_at", 2017-02-01 20:40:46 UTC]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "id_number" = ?, "name" = ?, "course" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["id_number", "201610843"], ["name", "Vic Angelo Olaguer"], ["course", "BS BA Management"], ["updated_at", 2017-02-13 05:36:03 UTC], ["id", 6]]